app/controllers/blogs_controller.rb

  def index
    @title = "Home"
    @blogs = Blog.all
---
SELECT "blogs".* FROM "blogs"

  def create
    @blog = Blog.new(params[:blog])
    if @blog.save
---
INSERT INTO "blogs" ("content", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["content", "Valid Content"], ["created_at", Mon, 28 Jan 2013 13:09:52 UTC +00:00], ["title", "Valid Title"], ["updated_at", Mon, 28 Jan 2013 13:09:52 UTC +00:00]]

  def update
    @title = 'Update'
    if @blog.update_attributes(params[:blog])
---
UPDATE "blogs" SET "title" = 'Valid Title', "content" = 'Valid Content', "updated_at" = '2013-01-28 14:12:40.875814' WHERE "blogs"."id" = 980190962