app/controllers/blogs_controller.rb

  def show
    @title = 'Show'
    @blog = Blog.find(params[:id])
---
SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT 1  [["id", "980190962"]]

  def edit
    @title = "Edit"
    @blog = Blog.find(params[:id])
---
SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT 1  [["id", "980190962"]]